Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh543-v2.tmx
Source language: bo
Languages: en

source: རོ་སྨད་གོས་གཅིག་པ་སྐྲ་བཤིག་པ་མིག་གཉི་ག་དམར་བ་ཅུང་ཟད་བཞིན་འཛུམ་པ་ལག་པ་གཡས་པས་སྒྲུབ་པ་པོ་ལ་སྡིགས་མཛུབ་བྱེད་པ།
en: She wears a single garment, has loose hair and red eyes, and is smiling a little. She displays the threatening mudrā toward the practitioner with her right hand and holds on to a branch of the tree with the left.

source: ལག་པ་གཡོན་པས་ཤིང་གི་ཡལ་ག་འཛིན་པ་ཡན་ལག་ཐམས་ཅད་མཛེས་པ། དར་ལ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་གོས་བགོས་པ།
en: All her limbs are adorned, and she is wearing a brightly colored, silken sash. {52.40}

source: ཁྲོ་བོའི་རྒྱལ་པོ་དེ་ཉིད་ཀྱི་རས་རིས་ཀྱི་མདུན་དུ་བདག་བྱང་དུ་མངོན་པར་བལྟས་ཏེ་འདུག་ལ་ཤིང་པ་ལ་ཤས་མེ་རབ་ཏུ་སྦར་ལ་གུ་གུལ་གྱི་རིལ་བུ་དག་ལ་ཞོ་དང་། སྦྲང་རྩི་དང་། མར་དག་གིས་བཏགས་ལ་དུས་གསུམ་དུ་ཞག་བདུན་གྱི་བར་དུ་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ལ།
en: “One should position oneself before the painting of the same Lord of Wrath, alert in mind and facing north, and light a fire of dhak sticks. One should offer into it, at the three junctions of the day for seven days, one thousand and eight bdellium pills smeared with curds, honey, and ghee.

source: དེ་ནས་ཞག་བདུན་པ་ལ་གཏོར་མ་རྒྱ་ཆེན་པོ་བྱས་ལ་མར་གྱི་མར་མེ་ཡང་རབ་ཏུ་སྦར་ལ། ཇི་སྲིད་ནམ་ཕྱེད་པ་དེའི་བར་དུ་བཟླས་པ་བྱས་ཏེ་འདུག་ནདེའི་འོག་ཏུ་གནོད་སྦྱིན་མོ་དེ་རང་ཉིད་སྣང་བ་ཆེན་པོར་བྱས་ཏེ། རང་གི་གཟུགས་ཀྱིས་འོང་བར་འགྱུར་རོ། །
en: One the seventh day, one should make an extensive bali offering, lighting butter lamps and reciting the mantra until midnight. The yakṣiṇī will then arrive in person in her own form, effulgent with great light. {52.41}

source: འོངས་ནས་ཀྱང་སྨྲ་བར་བྱ་བ་ནི་ངས་ཅི་ཞིག་བྱ་ཞེས་སོ། །
en: “When she arrives, she will say, ‘What can I do for you?’

source: དེ་ནས་སྒྲུབ་པ་པོས་བརྗོད་པར་བྱ་བ་ནི། ཁྱོད་ངའི་ཆུང་མར་གྱིས་ཤིག་ཅེས་བྱའོ། །
en: The practitioner should reply, ‘Be my wife.’

source: དེ་ལྟར་བགྱིའོ་ཞེས་བྱས་ནས་མི་སྣང་བར་འགྱུར་རོ། །
en: She will then say, ‘So be it!’ and will disappear.

source: དེ་ནས་བཟུང་ནས་ཆུང་མར་གྱུར་ཏེ་རང་གི་གནས་སུ་ཁྱེར་ནས་འདོད་པ་ཐམས་ཅད་སྟེར་བར་བྱེད་ཅིང་བཅུད་ཀྱིས་ལེན་ཡང་རབ་ཏུ་སྟེར་བར་བྱེད་དེ།
en: From then on, she will be the practitioner’s wife. She will grant his every wish and take him to her abode.

source: གང་འཐུངས་པས་ལྷའི་གཟུགས་སུ་འགྱུར་ཞིང་། གནོད་སྦྱིན་ཆེན་པོ་དང་རབ་ཏུ་འགྲན་པར་འགྱུར་རོ། །
en: He will obtain there an elixir of long life, and upon drinking it he will obtain a divine form, equal to the great yakṣa.

source: གལ་ཏེ་མ་འོངས་ན་ནི་ལན་གཉིས་པ་ལ་ཁྲོ་བོའི་སྔགས་དང་ལྷན་ཅིག་བཟླས་པ་བྱས་ན་ངེས་པར་འོང་བར་འགྱུར་རོ། །
en: If she does not arrive, the second time one should include in the recitation [the mantra of] Lord of Wrath , and she will certainly come.

source: གལ་ཏེ་མ་འོངས་ན་ནི་ཁྲོ་བོ་འཆོལ་བའི་རྒྱལ་པོས་འཆི་བར་འགྱུར་རོ། །
en: If not, she will wither and die. {52.42}

source: འདུད་མའི་སྔགས་ནི་འདི་ཡིན་ཏེ།
en: “The mantra of Naṭṭā is:

source: ཨོཾ་ན་ཊྚེ་ཤུ་ཀླཱ་མཱ་བ་ར་མཱ་ལྱ་དྷཱ་རི་ཎེ་མཻ་ཐུ་ན་པྲི་ཡེ་སྭཱ་ཧཱ།
en: “ Oṁ Naṭṭā! Wearing white garments and garlands, and fond of sex! Svāhā!

source: འདིའི་ཆོ་ག་ཡང་འདི་ཉིད་དོ། །
en: “Her ritual procedure is the same as the previous. {52.43}

source: རྗེ་བཙུན་མའི་སྔགས་ནི་འདི་ཡིན་ཏེ།
en: “The mantra of Bhaṭṭā is:

source: ཨོྃ་བྷད་ཏྲེ་བྷད་ཏྲེ་ཨ་བ་ལོ་ཀི་ནི་ཀིཉྩི་རཱ་ཡ་སི། ཨེ་ཧྱ་ཧི་ཨཱ་གཙྪ་ཨཱ་གཙྪ་མ་མ་ཀཱ་རྱཾ་ཀུ་རུ་སྭཱ་ཧཱ།
en: “ Oṁ Bhaṭṭā, Bhaṭṭā! Splendorous one, why do you tarry? Come, come! Arrive, arrive! Do my bidding! Svāhā!

source: དེ་ཉིད་ཀྱིས་ནི་རས་རིས་མེད་ཀྱང་འགྲུབ་པར་འགྱུར་ཏེ
en: “Her rite can be accomplished even without the painting.

source: རིའི་རྩེ་མོར་དཀྱིལ་འཁོར་བྱས་ལ་གུ་གུལ་གྱི་དུ་བས་བདུགས་ཏེ། གཅིག་པུ་མི་སྨྲ་བར་གནས་ཤིང་གཙང་སྦྲ་བྱས་ཏེ་སྒོ་བཅད་ལ་རིག་པ་སྟོང་རྩ་བརྒྱད་བཟླས་པ་བྱས་ན།
en: One should draw a maṇḍala in a prominent spot and recite her mantra one thousand and eight times while burning an incense of bdellium.

source: ཟླ་བ་གཅིག་གི་མཚན་མོ་ངེས་པར་འོང་བར་འགྱུར་ཞིང་འོངས་ནས་ཀྱང་འདོད་པ་སྤྱོད་པར་བྱས་ན། ཆུང་མར་འགྱུར་ཞིང་འདོད་པ་ཐམས་ཅད་སྟེར་བར་འགྱུར་རོ། །
en: If one does this without engaging in talk, alone, pure, and behind closed doors, she will certainly arrive within one month, at nighttime. {52.44} “When she arrives, the practitioner should make love to her, and she will become his wife who grants every wish.

source: གལ་ཏེ་དེ་ཁྱིམ་དུ་ཞུགས་ན་ནི་ལོ་སྟོང་ཕྲག་ལྔའི་བར་དུ་འཚོ་བར་འགྱུར་རོ། །
en: If he enters her house, he will live five thousand years.

source: གལ་ཏེ་མ་ཞུགས་ན་ནི་འཛམ་བུའི་གླིང་དུ་ལོ་ལྔ་བརྒྱ་འཚོ་བར་འགྱུར་ཞིང་རྣམ་པར་སྤྱོད་པར་འགྱུར་རོ། །
en: If not, he will stay in Jambūdvīpa and live five hundred years, playing with her.

source: དེ་དང་ལྷན་ཅིག་རྩེ་བར་བྱེད་ཅིང་ལུང་ཐམས་ཅད་ལ་ཡང་དག་པར་འགྲུབ་པར་བྱེད་དོ། །
en: She will carry out his every command.

source: དེ་དང་ལྷན་ཅིག་གང་དུ་འདོད་པ་དེར་འགྲོ་ཞིང་བཅུད་ཀྱིས་ལེན་རབ་ཏུ་སྦྱིན་པར་བྱེད་ལ། སྡུག་པའི་ཆུང་མ་བཞིན་དུ་ཕན་པའི་ལྷག་པའི་བསམ་པ་ཡང་རབ་ཏུ་བྱེད་དོ། །
en: She will go with him, wherever he wishes. She will procure for him the elixir of longevity, and, just as a beloved wife does, will act with the best of intentions. {52.45}

source: ནམ་གྲུ་མའི་སྔགས་ནི། ན་མཿསརྦ་ཡཀྵི་ཎཱཾ། ཨོཾ་རཀྟེ་རཀྟཱ་བ་བྷཱ་སི་རཀྟ་རཀྟ་ལེ་བ་ནི་སྭཱ་ཧཱ།
en: “The mantra of Revatī is, ‘ Homage to all the yakṣiṇīs!’ [The mantra to recite is]: “ Oṁ , red one with a red glow and wearing red unguents! Svāhā!

source: གནོད་སྦྱིན་མཆོག་ནི་ནམ་གྲུ་མ། །སྦྱོར་བ་ལ་དགའ་རྗོད་པར་བྱེད། །
en: “Revatī is a distinguished yakṣiṇī, Playful and fond of sex.

source: ཅུང་ཟད་དམར་བའི་གོས་གྱོན་ཞིང་། །སྔོ་ཞིང་འཁྱིལ་བའི་སྐྲ་ཡང་ཡོད། །
en: She wears a soft-red garment And has blue, curly hair. {52.46}

source: ཡན་ལག་ཀུན་མཛེས་གནོད་སྦྱིན་མོ། །
en: “This yakṣa lady is adorned on every limb

source: འདོད་པ་སྤྱོད་ལ་རྟག་ཏུ་དགའ། །
en: And always delights in the pleasures of sex.

source: འདོད་དང་ལོངས་སྤྱོད་རྟག་ཏུ་སྦྱིན། །
en: She always grants wishes and gives pleasure.

source: མཆོག་སྦྱིན་པར་ནི་རྟག་ཏུ་སྟོན། །
en: One should depict her displaying a boon-granting gesture. {52.47}

source: སྔ་མ་བཞིན་དུ་རས་ལ་མངོན་པར་བྲིས་ལ་འདིའི་ཁྱད་པར་ནི་འདི་ཡིན་ཏེ། དར་ལ་དམར་པོ་གྱོན་ཞིང་དར་ལ་དམར་པོས་སྟོད་གཡོགས་བྱས་ཤིང་།
en: “Her painting should be done as before, except that Revatī is wearing garments of red silk, including an upper garment of the same material.

source: ཁ་དོག་དམར་བར་ཡང་སྣང་བ་ཡིན་ནོ། །
en: Her complexion has a reddish glow. {52.48}

source: འོག་པག་མའི་སྔགས་ནི། ཨོཾ་མེ་ཁ་ལེ་མ་ཧཱ་ཡཀྵི་ཎཱི་མ་མ་ཀཱརྱྃ་སམྦཱ་ད་ཡ་སྭཱ་ཧཱ།
en: “The mantra of Mekhalā is: “ Oṁ Mekhalā! Great yakṣiṇī! Please do my bidding! Svāha! {52.49}

source: འོག་པག་མ་བཟང་མོའི་སྔགས་ནི། ཨོཾ་མེ་ཁ་ལེ་སུ་མེ་ཁ་ལེ་མ་ཧཱ་ཡ་ཀྵི་ཎཱཾ་སརྦ་ཨརྠ། སཱ་དྷ་ནི་ཧཱུྃ། ས་མ་ཡ་མ་ནུ་སྨ་ར་ཎེ་སྭཱ་ཧཱ།
en: “The mantra of Sumekhalā is: “ Oṁ Mekhalā, Sumekhalā! Great yakṣiṇī who fulfills every purpose, hūṁ ! Remember your samaya! Svāha! {52.50}

source: སྣང་བ་མའི་སྔགས་ནི། ཨྃ་ཨཱ་ལོ་ཀི་ནི་ལོ་ཀ་བ་ཏེ་སྭཱ་ཧཱ།
en: “The mantra of Ālokinī is: “ Oṁ Lokinī! Lokavatī! Svāhā!

source: འདི་དག་ནི་ཆོ་ག་ཡང་དེ་ཉིད་དོ། །
en: “The ritual procedure of the [last three] yakṣiṇīs is the same as before. {52.51}

source: མུན་པ་མཛེས་མའི་སྔགས་ནི། ཨོཾ་ཤྲཱི་ཎུ་གུ་ཧྱ་ཀེ་ཤྲཱི་ཎུ་གུ་ཧྱ་ཀེ་ཨེ་ཧྱ་ཧི་གུ་ཧྱཻ་ཧི་གུཧྱ་ཀེ་སྭཱ་ཧཱ།
en: “The mantra of Tamasundarī is: “ Oṁ ghuṇu! Ghuṇu, ghuṇu , O secret one! Come, come, O guhyakī! Svāhā!

source: འདིའི་ཆོ་ག་ལ་ནི་རས་རིས་ཀྱི་ཆོ་ག་ནི་འདི་ལ་མེད་དོ། །
en: “As for her practice, no painting of her is prescribed.

source: དང་པོར་རེ་ཞིག་གཙང་ཞིང་གོས་གཙང་མ་བགོས་ཏེ། ཟླ་བ་ཉ་བ་ལ་གནས་དབེན་པར་འདུག་ནས་སྒོ་བཅད་དེ་སྣང་བ་མེད་པར་མུན་པའི་གནས་སུ་རིག་པ་སྟོང་ཕྲག་བཅུ་བཟླས་ན་སྔོན་དུ་བསྙེན་པ་བྱས་པར་འགྱུར་རོ། །
en: One should start during a full moon, wearing clean clothes and being clean oneself, in a secluded place . . . . One should firmly shut the door and recite her vidyā ten thousand times in complete and utter darkness. This constitutes the preliminary practice. {52.52}

source: དེ་ནས་སྒྲུབ་པ་པོས་བརྩམ་པར་བྱ་བ་ནི་ཟླ་བ་ཉ་ནས་བརྩམས་ནས་
en: “Afterward, one should begin the formal practice.

source: ཟླ་བ་ཉ་གཉིས་པའི་བར་འདིར་ལས་སུ་བྱ་བ་ནི། མཚན་མོ་ཉལ་བའི་དུས་སུ་མལ་དུ་འདུག་ནས་མི་སྣང་ཞིང་དབེན་པའི་ས་ཕྱོགས་སུ་གཅིག་པུ་སྒོ་བཅད་ལ།
en: One should start during a full moon and perform the rite until the next full moon, doing it alone at night in an isolated and hidden place, when it is time to sleep and one is in bed with the door closed, in complete and utter darkness.

source: དོང་ཀ་དང་བཱ་ན་ཀའི་མེ་ཏོག་ལེགས་པར་ཁ་འབུས་པ་ཡུངས་མར་དང་བསྲེས་པས། ལག་པ་དང་རྐང་པ་ལ་བྱུགས་ལ། ལག་པ་གཡས་པ་ལ་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བསྔགས་པ་བྱ་སྟེམི་སྨྲ་བའི་དཀའ་ཐུབ་ཀྱིས་བཟླས་པ་བྱའོ། །
en: One should blend closed lotus buds and vānapuṣpa with white mustard oil and rub it onto one’s hands and feet. One should incant the right arm one hundred and eight times and go to sleep in silence.

source: དེ་བཞིན་དུ་ཉིན་རེ་ཞིང་མ་ཆད་པར་ཟླ་བ་ཉའི་བར་དུ་བྱས་ན་དེ་ནས་མཚན་ཕྱེད་ཙམ་ན་ངེས་པར་འོང་བར་འགྱུར་རོ། །
en: If one does this every day until the next full moon, then Tamasundarī will arrive for certain at midnight. {52.53}

source: འོངས་ནས་ཀྱང་མི་སྨྲ་བར་བྱ་ཞིང་། ཅང་མི་སྨྲ་བར་གྱུར་པས་འདོད་པ་བསྟེན་པར་བྱའོ། །
en: “When she arrives, one should not engage her in conversation but make love to her in silence.

source: གང་གི་ཚེ་ཟླ་བ་དྲུག་ན་སྨྲ་བ་དེའི་ཚེ་སྨྲ་བར་བྱ་སྟེ།
en: If, within six months, she starts conversing, one should join in.

source: དེ་ནས་བཟུང་ནས་ཆུང་མར་འགྲུབ་པར་འགྱུར་ཏེ། འདོད་པ་ཐམས་ཅད་སྟེར་བ་དང་འདི་ལ་ལྷའི་རེག་པ་བཟང་པོ་ཡང་སྦྱིན་པར་བྱེད་དོ། །
en: From then on she will be an accomplished object of the practice, becoming one’s wife who grants every desire and whose soft touch gives divine pleasure.

source: ཉིན་པར་མ་མཐོང་བ་ཁོ་ནར་ཡང་ལས་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་དོ། །
en: She will perform all tasks even when she is out of sight

source: རོ་དང་བཅུད་ཀྱིས་ལེན་རྣམས་ཀྱང་རབ་ཏུ་སྟེར་བར་བྱེད་དོ། །
en: and will also procure the essential elixir of longevity. {52.54}

source: རྒྱབ་ཏུ་ཞོན་ན་ནི་རི་རབ་ཏུ་ཡང་ཁྱེར་བར་བྱེད་དོ། །
en: “Taking the practitioner upon her back,

source: མཚན་མོ་འཛམ་བུའི་གླིང་ཀུན་ཏུ་ཡང་འཁོར་བར་བྱེད་དོ། །
en: At night, she will take him all the way around Jambūdvīpa.

source: དཔག་ཚད་བརྒྱ་ན་ཡོད་པའི་དགྲ་དེ་དག་ཀྱང་འཇོམས་པར་བྱེད་དོ། །
en: She will crush one’s enemies, even at a distance of one hundred leagues.

source: ཇི་སྐད་བསྟན་པ་དེ་ཐམས་ཅད་སྒྲུབ་པར་བྱེད་དོ། །
en: Whatever she is ordered to do will turn out well,

source: གཞན་གྱི་བུད་མེད་ལ་འགྲོ་བ་ནི་མ་གཏོགས་སོ། །
en: except for sexual advances on other women.

source: གཞན་གྱི་བུད་མེད་ལ་འགྲོ་བར་བྱེད་པའི་ཆོ་ག་ནི་འདི་དག་ཐམས་ཅད་ལ་ཡང་སྦྱར་ཏེ། དེ་ཉིད་དང་ལྷན་ཅིག་ཡང་དག་པར་བསྟེན་པར་བྱའོ། །
en: This rule applies to all the yakṣiṇīs. One must not approach other women but cohabit only with them.

source: གལ་ཏེ་གཞན་གྱི་བུད་མེད་ལ་འགྲོ་བར་འགྱུར་ན་ནི་འཆི་བ་སྐྱེད་པར་ཡང་འགྱུར་རོ། །
en: If one goes to other women, they will cause death or insanity. {52.55}

source: འདི་ནི་མུན་ནག་མཛེས་མ་ཞེས་བྱ་བ་གནོད་སྦྱིན་མ་སྟོང་ཕྲག་དུ་མས་ཡོངས་སུ་བསྐོར་བས་སྒྲུབ་པ་པོས་འགྲུབ་པར་འགྱུར་ན་ཉིན་རེ་ཞིང་གནོད་སྦྱིན་མོའི་བྲན་མོ་རེ་རེ་གཏོང་བར་བྱེད་དོ། །
en: “This yakṣiṇī, [also] called Andhārasundarī, is surrounded by many hundreds of thousands of yakṣiṇīs. When accomplished as an object of practice by any practitioner, she dispatches, every single day, one yakṣiṇī-servant for each of them.

source: བློན་པོའི་འཁོར་དུ་མ་དང་ལྡན་པ་དང་གནོད་སྦྱིན་མོ་ཐམས་ཅད་ན་ཡང་རྫུ་འཕྲུལ་ཆེ་བ་དང་མུན་པས་བསྐོར་བ་འདི་དག་ཐམས་ཅད་ཀྱང་ཆོ་ག་ཐ་དད་པ་མ་ཡིན་མོད་ཀྱི་འོན་ཀྱང་གཞན་དེ་དག་ནི་མཐོང་བར་འགྱུར་རོ། །
en: She has a retinue of many ministers, all of them yakṣiṇīs, among whom she is distinguished by her great miraculous power and her cover of darkness. As the ritual procedure is the same for all of them, could one see any of them? It is not possible to see her. {52.56}

source: མུན་ནག་ཆེན་པོ་ན་གནས་པ་ཞེས་བྱ་བའི་གནོད་སྦྱིན་མོ་རྫུ་འཕྲུལ་ཆེ་བ་དང་ཕུག་གནས་མ་དང་མིའི་དཔའ་མོ་དང་གཞོན་ནུ་མ་འཇིག་རྟེན་རྣམ་པར་གྲགས་པ་དང་། མནའ་མ་གནོད་སྦྱིན་མོ་དང་ཡིད་དུ་འོང་མ་དང་བདུན་པ་ལྷ་མཛེས་མ་དང་འདི་དག་ནི་གནོད་སྦྱིན་མོ་བདུན་དག་སྟེསེམས་ཅན་རྣམས་རྗེས་སུ་འཛིན་པར་བྱེད་པའོ། །
en: “Among the yakṣiṇīs, famous throughout the world, There is also Andhāravāsinī, Endowed with great miraculous power, Guhāvāsinī, Naravīrā, Yakṣakumārī, {52.57} “Vadhūyakṣiṇī, Manojñā, And the seventh, Surasundarī. These seven yakṣiṇīs perform Acts of kindness for sentient beings. {52.58}

source: ས་རྣམས་མ་ལུས་དག་ཏུ་ནི། །འཇིག་རྟེན་འདིར་ནི་ཡོངས་སུ་རྒྱུ། །ཅུང་ཟད་ཀྱི་ནི་དུས་དག་ཏུའང་། །ལྷའི་གནས་སུ་ཡང་འགྲོ་བར་བྱེད། །
en: “They wander around this world And the entire earth. Within a brief moment, They can ascend to the world of the gods. {52.59}

source: ལྷ་དང་ལྷ་མིན་གཡུལ་དག་ཏུའང་། །རྫུ་འཕྲུལ་ཆེན་པོས་འཐབ་པར་བྱེད། །
en: “Being endowed with great miraculous powers, They take part in battles between the gods and the daityas.

source: ཆོས་ལྡན་སྙིང་ནི་བརྩེ་བ་དང་། །སེམས་ཅན་འདོད་ཅིང་མཉེས་གཤིན་བཟང་། །སེམས་ཅན་ཕན་པའི་འདོད་དོན་དུ། །ས་སྟེང་དག་ཏུ་ཡོངས་སུ་རྒྱུ། །
en: They are virtuous, compassionate, and lovingly tender Toward beings for whom they are objects of desire. {52.60} “They wander upon the earth, Intent upon helping sentient beings.

source: དེ་ལ་བསྒྲུབ་དཀའ་ཅུང་ཟད་མེད། །དགེ་བའི་ལས་རྣམས་མ་ལུས་བྱེད། །
en: Nothing is difficult for them to accomplish, And they do a splendid job with every task.

source: སེམས་ཅན་ལོངས་སྤྱོད་དོན་དུ་ནི། །བྱང་ཆུབ་སེམས་དཔས་བཤད་པ་ཡིན། །
en: The Bodhisattva taught [their rites] To bring enjoyment to beings. {52.61}

source: ཕུག་གནས་མའི་སྔགས་ནི། ཨོཾ་གུ་ཧི་ལི་གུ་ཧ་པ་ཏི་གུ་ཧ་བཱ་སི་ནི་ཨཱ་ན་ཡ་བྷ་ག་བ་ཏི་མ་མཱ་ཏི་ཀྃ་ས་མ་ཡ་མ་ནུ་སྨ་ར་སྭཱ་ཧཱ།
en: “The mantra of Guhāvāsinī is: “ Oṁ Guhilā , Guhāmati, Guhāvāsinī! Please come, O blessed one, close to me! Remember your samaya! Svāhā!

source: སེང་ལྡེང་གིས་མེ་རབ་ཏུ་སྦར་ལ། པྲི་ཡང་ཀུའི་མེ་ཏོག་ལ་མར་གྱིས་བཏགས་ཏེཟླ་བ་གཅིག་གི་བར་དུ་དུས་གསུམ་དུ་སྦྱིན་སྲེག་སྟོང་རྩ་བརྒྱད་བྱས་ན་སྔོན་དུ་བསྙེན་པ་བྱས་པར་འགྱུར་རོ། །
en: “One should light a fire with sticks of cutch wood and offer into it, at the three junctions of the day for one month, one thousand and eight oblations of beautyberry flowers smeared with ghee. This constitutes the preliminary practice. {52.62}

source: དེ་ནས་དེའི་འོག་ཏུ་སྒྲུབ་པ་བརྩམ་པར་བྱ་སྟེ།
en: “Afterward, one should begin the formal practice.

source: དང་པོར་རེ་ཞིག་བྱང་བུའམ་རས་སམ་རྩིག་པ་ལ་ཚོན་མ་འདྲེས་པ་སྣོད་སར་པ་དག་གི་ནང་དུ་བཅུག་པའི་པིར་དག་གིས་རིའི་རྒྱལ་པོ་རི་རབ་ཟུར་བཞི་དང་རྩེ་མོ་བཞི་དང་ལྡན་པ། རི་བདུན་གྱི་ཕྲེང་བས་ཡོངས་སུ་བསྐོར་བ།
en: Using uncontaminated paints, a new brush, and a new paint container, one should first draw the king of mountains, Mount Sumeru, either on a tablet, or a piece of cloth, or a wall. It has four slopes and four lofty peaks and is surrounded by a range of seven mountains.

source: རི་དེ་དག་གི་མཐའ་མར་རི་བོ་དག་ལ་བརྟེན་པའི་ཕུག་ཀུན་ཏུ་བྲི་བར་བྱའོ། །
en: At the outer edge of these mountains, one should draw a cave that is situated in a mountainside. {52.63}

source: དེར་གནས་པ་ལྷའི་གཟུགས་དང་ལྡན་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། གཅིག་པུ་གནོད་སྦྱིན་མ་ཕུག་གནས་མ་ཞེས་བྱ་བ་རོ་སྨད་དར་ལ་གོན་པ། སྟོད་གཡོགས་དར་ལ་གྱོན་པ།
en: “In there, one should draw a single, divinely beautiful yakṣiṇī called Guhāvāsinī, adorned with all the ornaments and wearing lower and upper garments of fine silk.

source: གསེར་གྱི་མདོག་ཅན་རྣམ་པ་སྣ་ཚོགས་གཟུགས་མཛེས་པ་བྲི་བར་བྱ་སྟེ
en: She has a golden complexion and a strikingly beautiful form.

source: དེ་ལྟ་བུའི་རས་རིས་བྲི་བར་བྱའོ། །
en: One should draw the painting like that

source: གཙང་བའི་གནས་སུ་གཙང་བས་འོ་མའི་ཟས་ཀྱིས་འཚོ་ཞིང་། རིག་པ་སྟོང་ཕྲག་བཅུ་བཟླས་པར་བྱ་སྟེ།
en: and recite the vidyā [of Guhāvāsinī] ten thousand times, staying in a clean place, oneself clean and living off a diet of milk.

source: ཅི་ནུས་པའི་མཆོད་པ་ཆེན་པོ་བྱས་ན་བཟླས་པའི་ཐ་མར་ལྷའི་གཟུགས་དང་ལྡན་པའི་གནོད་སྦྱིན་མོ་སྣང་བ་ཆེན་པོ་དང་ལྡན་པར་བྱས་ནས་རང་ཉིད་འོང་བར་འགྱུར་རོ། །
en: One should offer a large pūjā, or one according to one’s means. Then, at the end of recitation, the yakṣiṇī will arrive in person, in her divinely beautiful form, effulgent with great light. {52.64}

source: འོངས་པ་ན་སྣ་མའི་མེ་ཏོག་དང་ཙནྡན་དཀར་པོ་བསྲེགས་ནས་མཆོད་ཡོན་དབུལ་བར་བྱའོ། །
en: “When she has arrived, one should give her a welcome offering of water mixed with white sandalwood and jasmine flowers.

source: དེ་ནས་དེས་བུ་ཅི་ཞིག་བྱ། ཞེས་སྨྲ་བར་བྱེད་དོ། །
en: She will say, ‘Child, what can I do for you?’

source: དེས་སྨྲ་བར་བྱ་བ་ནི་བདག་གི་མར་མཛོད་ཅིག་ཅེས་སོ། །
en: One should say, ‘Please be my mother.’

source: དེ་བཞིན་དུ་བྱའོ་ཞེས་བྱས་ནས་མི་སྣང་བར་འགྱུར་རོ། །
en: She will reply, ‘So be it!’ and will disappear.

source: དེ་ལ་སེམས་འགྱོད་པར་ནི་མི་བྱ་སྟེ། དེ་ལ་འདོད་པ་དང་ལྡན་པ་ཡང་དོན་དུ་གཉེར་བར་ཡང་མི་བྱའོ། །
en: One must not hurt her feelings and not request anything that is tainted with sensuality.

source: དེ་ལ་འཕགས་མ་རྫུ་འཕྲུལ་ཆེ་བ་དོན་དུ་གཉེར་ན་འགྲུབ་པར་འགྱུར་ཏེ། དེ་ཕན་ཅད་དེ་ལ་མ་དང་འདྲ་བར་བྱ་བ་ཐམས་ཅད་བྱེད་པར་འགྱུར་རོ། །
en: She is noble and very dignified, so if one requests sensual pleasures one will not succeed. From then on, she will perform all the duties like a mother. {52.65}

source: འཁོར་བརྒྱད་བརྒྱ་དང་བཅས་པ་ལ་ཟས་དང་གོས་རབ་ཏུ་སྟེར་བར་འགྱུར་རོ། །
en: “She will also provide food and clothes to one hundred and eight people from one’s retinue.

source: གནས་ཡང་བ་ལས་ཀྱང་སྐྱོབ་པར་བྱེད་དོ། །
en: She will protect one in difficult situations.

source: དགོན་པ་ཆེན་པོ་དང་རིའི་སྟེང་དུ་གནས་ན་ཡང་ལས་ཐམས་ཅད་ཡང་དག་པར་སྒྲུབ་པར་བྱེད་དོ། །
en: She will carry out all her duties, even if one were staying in a deep forest or on the top of a mountain.

source: བཟའ་བ་ཅི་འདོད་པ་ཡང་རབ་ཏུ་སྦྱིན་ནོ། །
en: She will provide one’s favorite food and all other things,

source: རོ་དང་བཅུད་ཀྱིས་ལེན་ལ་སོགས་པ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་སྦྱིན་ཞིང་ཅི་འདོད་པ་ཡང་རྗེས་སུ་སྒྲུབ་པར་བྱེད་དོ། །
en: such as the essential elixir of life and so forth. Complying with one’s wishes, whatever they are,

source: ཁང་པ་དང་ཁང་པ་རྩེག་མ་ཡང་མངོན་པར་སྤྲུལ་པར་བྱེད་དོ། །
en: she will magically create a monk’s hut, a family house, or another shelter.

source: གསེར་སྟོང་ཕྲག་ཀྱང་ཉིན་རེ་ཞིང་རབ་ཏུ་སྦྱིན་པར་བྱེད་དོ། །
en: Every single day she will give one thousand pieces of gold,

source: དེ་ཉིད་ཀྱི་ཉིན་པར་ཐམས་ཅད་ཟད་པར་བྱས་ཏེ།
en: which must all be spent that very day.

source: གལ་ཏེ་མི་བྱེད་ན་རྣམ་པར་ཆད་པར་འགྱུར་ཏེ།
en: If one does not spend it all, it will be cut back.

source: ཐམས་ཅད་ཀྱི་ཐམས་ཅད་དུ་མེད་པར་འགྱུར་རོ། །
en: If one keeps it all, none will remain. {52.66}

source: གཞན་ཡང་འདིའི་ལས་ནི་རས་རིས་འདི་ཉིད་ཀྱི་མདུན་དུ་སེང་ལྡེང་གི་མེ་རབ་ཏུ་སྦར་ལ། འབར་བ་དང་དུ་བ་དང་བྲལ་བའི་མདག་མ་ལ་ལག་པ་གཡས་པའི་མཐིལ་དུ་ལྡོང་རོས་ཀྱིས་གཟུགས་བརྙན་དུ་བྲིས་ཏེསྐྱེས་པའམ་བུད་མེད་ཀྱི་མིང་ལག་པ་གཡོན་པའི་མཐིལ་དུ་བྲིས་ལ་མེ་མདག་གི་ཕུང་པོ་དེ་ལ་བདུགས་ཤིང་སྔགས་བཟླས་པ་བྱས་ན་
en: “There is also another rite of Guhāvāsinī. One should light a fire in front of the same painting with sticks of cutch wood [and bring it to the stage where] the embers emit no flames or smoke. Using red arsenic, one should draw on the palm of one’s right hand the image and the name of a man or, if it is a woman, on the palm of one’s left hand, and heat it over the same heap of embers while reciting the mantra.

source: དཔག་ཚད་བརྒྱ་ན་གནས་ཀྱང་འོང་བར་འགྱུར་ཏེགང་སྨྲས་པ་དེ་ཐམས་ཅད་བྱེད་དུ་གཞུག་པར་འགྱུར་རོ། །
en: Guhāvāsinī will summon them even from the distance of one hundred leagues and will compel them to do everything that was asked.

source: ལས་འདི་ཉིད་ནི་མཚན་མོ་བྱ་བ་ཡིན་གྱི་ཉིན་པར་ནི་མ་ཡིན་ནོ། །
en: This rite should be performed at night, not during the day. {52.67}

source: མི་དཔའ་མོའི་སྔགས་ནི། ཨོཾ་ན་ར་བཱི་རེ་སྭཱ་ཧཱ།
en: “The mantra of Naravīrā is: “ Oṁ Naravīrā! Svāhā!

source: དེ་བཞིན་དུ་འདིའི་རས་རིས་ཀྱང་བྲི་བར་བྱ་སྟེ། ཕུག་གི་གནས་ནི་མ་གཏོགས་ཏེ།
en: “Her painting should be executed exactly the same as [the painting of Guhāvāsinī], except for the cave dwelling.

source: ཤིང་མྱ་ངན་མེད་ལ་བརྟེན་པ་བྲི་བར་བྱས་ལ་འདིའི་ཁྱད་པར་ནི་འདིའོ། །
en: Instead, Naravīrā should be drawn next to an aśoka tree.

source: ལས་གཞན་ཐམས་ཅད་ནི་ཕུག་གནས་མ་དེ་བཞིན་དུ་བྱའོ། །
en: The entire ritual is just like that of Guhāvāsinī,

source: འདི་ལ་ནི་སྲིང་མོ་ཞེས་ཀྱང་བརྗོད་པར་བྱའོ། །
en: except that Naravīrā should be addressed, ‘Please be my sister!’ {52.68}

source: འདི་ལ་ལས་གཞན་ཡང་ཡོད་དེ།
en: “There is also another rite of Naravīrā.

source: ཟླ་བ་གཟས་ཟིན་པ་ལ་བཙག་ཡུག་སྣམ་གྲོ་བ་ལ་བཏུམས་ཏེ་ཁར་བཅུག་ནས་ཇི་སྲིད་དུ་ཟླ་བ་གཟས་བཏང་གི་བར་དུ་བཟླས་ན།
en: During a lunar eclipse, one should wrap some red ocher in a piece of birch bark, put it in one’s mouth, and recite the mantra until the moon comes out of eclipse.

source: དེ་ནས་བཙག་ཡུག་སྣམ་གྱི་བུད་མེད་དམ་སྐྱེས་པ་གང་གི་མིང་བྲིས་པ་དེ་དཔག་ཚད་བརྒྱ་ན་གནས་ཀྱང་དེ་ནས་འོང་བར་བྱེད་དོ། །
en: Then, whichever woman’s name one writes with this ocher, Naravīrā will summon her even from a distance of one hundred leagues,

source: ཐོ་རངས་ནི་དེ་ཉིད་དུ་ཁྱེར་བར་བྱེད་དོ། །
en: and in the morning she will take her back to her original place.

source: སྲིང་མོ་བཞིན་དུ་བྱ་བ་རྣམས་ཀྱང་བྱེད་དོ། །
en: She will do everything just as a sister would.

source: ཕོངས་པའི་དུས་སུ་ཡང་སྲུང་བ་ཆེན་པོ་བྱེད་དོ། །
en: In the event of disasters, she will offer great protection.

source: བཟླས་པ་ཙམ་གྱིས་བུད་མེད་ཐམས་ཅད་དབང་དུ་བྱེད་པར་འགྱུར་རོ། །
en: One can enthrall any woman by merely reciting the mantra.

source: མིའི་དབང་མོའི་ཆོ་ག་ནི་འདིའོ། །
en: This is the rite of Naravīrā. {52.69}

source: གནོད་སྦྱིན་གཞོན་ནུ་མའི་སྔགས་ནི། ཨོཾ་ཡཀྵ་ཀུ་མཱ་རི་ཀེ་སྭཱཧཱ།
en: “The mantra of Yakṣakumārī is: “ Oṁ Yakṣakumārī! Svāhā!

source: འདིའི་ཆོ་ག་ནི་གྲོ་བ་ལ་གི་ཝང་གིས་བྲི་བར་བྱ་སྟེ།
en: “Her practice is as follows.

source: གཞོན་ནུ་མ་མགོའི་སྐྲ་ཕྱེད་བཅིངས་པ་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། གོས་གཅིག་པ་ལག་པ་གཡས་པ་ན་མ་དུ་ལུང་གའི་འབྲས་བུ་འཛིན་པ་ལག་པ་གཡོན་པས་ཤིང་མྱ་ངན་མེད་ལ་འཛིན་པ། དེ་ལྟ་བུའི་གྲོ་བའི་འདབ་མ་མགོའི་གནས་ཀྱི་སྟེང་དུ་གཞག་པར་བྱས་ནསདགོན་པའི་ཕྱོགས་སུ་གཅིག་པུ་ཉལ་བར་བྱས་ཏེ།
en: She should be drawn on a piece of birch bark, using bovine bezoar, as a young girl with slightly curly hair, adorned with all the ornaments, and wearing a single piece of clothing. In her right hand she is holding a fruit filled with seeds, and with the other she is holding onto a branch of an aśoka tree. {52.70} “One should place this piece of birch bark above the place where one’s head is going to be and sleep alone in a hidden place.

source: ཙནྡན་དཀར་པོའི་ལྡེ་གུས་དཀྱིལ་འཁོར་བྱས་ལ་དུས་གསུམ་དུ་སྣ་མའི་མེ་ཏོག་གིས་གཅལ་བཀྲམ་པར་བྱས་ལ་གུ་གུལ་གྱི་བདུག་པས་བདུགས་ནས།
en: One should draw a maṇḍala with white sandalwood paste and, at the three junctions of the day, bestrew it with jasmine flowers, burn an incense of bdellium, and recite the vidyā one thousand and eight times.

source: རིག་པ་སྟོང་རྩ་བརྒྱད་ཟླ་བ་གཅིག་གི་བར་དུ་བཟླས་ཏེ།
en: One should do this for a period of one month. {52.71}

source: དེ་ནས་ཟླ་བ་ཉ་བ་ལ་སྣ་མའི་མེ་ཏོག་གིས་མཆོད་པ་ཆེན་པོ་བྱས་ལ། མར་གྱི་མར་མེ་དང་ལྷ་བཤོས་ཀྱང་ཕུལ་ནས་ཀུ་ཤའི་ཁྲེས་ལ་ཉེ་བར་འདུག་ནས། ཇི་སྲིད་དུ་རྣམ་ཐོས་སྲས་ཀྱི་བུ་མོ་རང་གི་གཟུགས་ཉིད་ཀྱིས་གཞོན་ནུ་མ་ལྔ་བརྒྱས་ཡོངས་སུ་བསྐོར་བ་འོང་ཞིང་ཕྱོགས་དེ་ཐམས་ཅད་སྣང་བར་བྱས་ནས།
en: “Then, during the full moon, one should prepare a large pūjā with jasmine flowers and offer butter lamps and food articles. At nighttime, sitting on a bundle of kuśa grass, one should recite the mantra until Kumārī, the daughter of Vaiśravaṇa, arrives in her usual form along with a retinue of five hundred.

source: རང་གི་གཟུགས་ཀྱི་ནམ་མཁའ་ལ་འདུག་པར་འགྱུར་ཞིང་། དེ་ཡང་འདི་སྐད་དུ་བདག་གིས་ཅི་ཞིག་བྱ་ཞེས་སྨྲས་པ་དང་།
en: Drawing one’s attention to the entire region [of the sky], she will remain naturally suspended in midair. She will ask,

source: དེ་ནས་སྒྲུབ་པ་པོས་སྨྲ་བར་བྱ་བ་ནི། མཆོག་གསུམ་ལས་གང་ཡང་རུང་བ་གཅིག་དོན་དུ་གཉེར་བར་བྱ་བ་ནི། མ་ཉིད་དང་སྲིང་མོ་ཉིད་དང་ཆུང་མ་ཉིད་དོ། །
en: ‘What can I do for you?’ The practitioner should then request from her one of the three boons—that she either be his mother, sister, or wife. {52.72}

source: གལ་ཏེ་མར་གྱུར་ན་ནི་སེམས་ལ་འགྱོད་པར་མི་བྱ་སྟེ།
en: “If she becomes one’s mother, one must not hurt her feelings.

source: འགྱོད་ན་ནི་རྣམ་པར་འཇིག་པ་འབྱུང་བར་འགྱུར་བས་མ་བཞིན་དུ་བསྒྲུབ་པར་བྱའོ། །
en: If one does, ruin will follow. One must treat her like a mother,

source: མ་དེས་ཀྱང་བསམས་པ་ཙམ་གྱིས་འཁོར་ལྔ་བརྒྱ་དང་བཅས་པའི་ཟས་དང་། གོས་དང་རྒྱན་གྱི་ཁྱད་པར་ཐམས་ཅད་ཀྱང་ཡང་དག་པར་སྒྲུབ་པར་བྱེད་དོ། །
en: and she, the mother, will fully provide an assortment of foodstuffs, clothes, and adornments for oneself and a retinue of five hundred, if these things are merely wished for.
